{"content":{"0":"@TBSkyen But how long will it take tho? Theyre pretty busy with the covid19 vaccine","1":"Out of 63 women who took the covid19 vaccine, 61 women became infertile... #COVID19 #coronavirus #vaccine #COVID19vaccine #fertility https:\/\/t.co\/XUjB4gzM4Z","2":"https:\/\/t.co\/zgiLBHyiRy\nPhase I:  Study to Assess the Safety, Tolerability, and Immunogenicity of a Recombinant Coronavirus-Like Particle #COVID19 Vaccine by @medicagoinc. Estimated Primary Completion Date: September 12, 2020","3":"WHO, partners unveil ambitious plan to deliver 2 billion doses of #Covid19 vaccine to high-risk... https:\/\/t.co\/HilSiZD4Ml via @statnews @HelenBranswell","4":"Entire communications is moving towards Webinar: #AgeofDiscovery\n https:\/\/t.co\/8rSPY5M62C via @YouTube \n\n#varindianewshour #VideoStreamingServices #Covid19 #Internationalonlinegame #covid19vaccine #Coronavirus #Sony #xiaomiindia #Facebook #covid19insurancescheme #SMohiniRatna","5":"@florian_krammer What are your thoughts on CanSino’s COVID19 vaccine and Antibody Dependent Enhancement of Infection (ADE)? Having personally witnessed the failure of the feline FIP CoV vaccine, ADE and SARSCOV2 vaccines give me nightmares https:\/\/t.co\/brmjtGDUle","6":"likely subject (s) of PMs address today...\n\nBreakthrough in developing COVID19 vaccine...\n\nUnlock down 2.0..\n\nStimulus 2.0...\n\nPeace Overture to China...\n\nExpect markets to react extremely positive today and gap up tomorrow...\n@_anujsinghal \n@AnilSinghvi_ \n#Nifty \n#banknifty","7":"📺 Watch our new interview on #COVID19 #vaccine development with Dr. Volker Gerdts @VIDOInterVac!","8":"Our science and technology team is honored to be working with @DukeMedSchool and @TheDHVI to provide laboratory and clinical space within @TheRTP's #ParmerRTP campus. \n\nhttps:\/\/t.co\/gwKCfzkN5e\n\n#immunology #clinicaltrials #lifescience #vaccineresearch #COVID19vaccine #HIVvaccine","9":"So, China wins the race of COVID19 vaccine ?? \n\nhttps:\/\/t.co\/lKeffPjadl","10":"@BNODesk Its either 100% full of major &amp; popular gather places or 100% full of ICU &amp; hospitals with people gathering at hospitals ER until a Covid19 vaccine. Until Pandemic is over you can't have the old normal. Best Wishes to the all 💞","11":"@thehill And BTW, I am in support of vaccinations. But those vaccines have been studied for YEARS and the dangers and risks are know and relatively harmless. A covid19 vaccine will not have this long term case study to prove it's safeguards.","12":"Mor people pledge to kill themselves, their children &amp; others as Covid19 vaccine potential grows #vaccines #coronavirus   https:\/\/t.co\/g5rBV21ASE","13":"#COVID19 vaccine thread https:\/\/t.co\/FxSwIOvzjM","14":"Promising results mean #COVID19vaccine trial could begin by August: Duke-NUS study — https:\/\/t.co\/LqBj6piiRU https:\/\/t.co\/RsgO9Py1Ur","15":"@apt_arinda @mukinga_manuel @rastakhid01 @undreadedrasta @MariamStilaal @NamanyaRender @manty_flex @Fynst_stalker @Arnoldtugumegm1 This level o research can make us get Covid19 vaccine by mid July...eh..uot.😂","16":"#DefundThePolice or #COVID19 #vaccine either way #Gates and associates will get the #PopulationControl they seek. \n\n#DemocratsAreDangerous \n#DemocratsAreCorrupt \n#DemocratsAreDestroyingAmerica \n\n#VoteRedToSaveAmerica \n#VoteRedToSaveCalifornia","17":"China approves #COVID19 vaccine for military use, skips final phase of testing | @CBCNews \n\n https:\/\/t.co\/17HzACjDtm\n#Coronavirus #HealthTech\n\nCc @jblefevre60 @psb_dc @helene_wpli @YuHelenYu @ahier @IrmaRaste @DeepLearn007 @CathCervoni @kalydeoo @Xbond49 @Paula_Piccard @MiaD https:\/\/t.co\/cz8Tb2LM3t","18":"#आत्मनिर्भरभारत #COVID19 #vaccine  #COVAXIN developed by Bharat Biotech https:\/\/t.co\/8PkvS9dKF4","19":"In Trump's America, no way will the #COVID19 vaccine be available to all (look at testing and treatment NOW!)\nIn Biden's America we will #FlipTheSenate and finally get a public option with common sense negotiation for drug prices. https:\/\/t.co\/0FjgS3SQ3j","20":"@carla_smith816 @TheJusticeDept Your ignorance is showing. First one has been debunked; his profit \"virtually negligible\". Second, the President doesn't approve new drugs, the FDA  does. 9 different companies are in phase 1 trials for a Covid19 vaccine. No one knows which will be 1st.\nhttps:\/\/t.co\/sq2t0ksu1s","21":"#Covid19 vaccine research must involve Black and Latinx participants. Here are 4 ways to make that... https:\/\/t.co\/V2E3jGeoC0 \nvia @statnews","22":"It’s inspiring to hear our CEO Albert Bourla discussing Pfizer’s latest efforts to develop a #COVID19 vaccine on Harvard Business Review’s podcast. #PfizerProud #PFEColleague https:\/\/t.co\/1u1UQ6yUDl","23":"#Covaxin #BIG_BREAKING: After successfully testing animals, Union Health Min approves clinical human trails for #India's first #COVID19 vaccine. Its being co-developed by @BharatBiotech &amp; @icmr_niv. #Telangana CM #KCR said #Covid vaccine will come from #Hyderabad by August.","24":"All the talk of a #COVID19 vaccine appear to have completely disappeared, what exactly is going on","25":"Fauci warns that with one-third of the population saying they will not get the #covid19 vaccine, herd immunity is unlikely. #coronavirus #coronavirusvaccine #covidvaccine #Fauci https:\/\/t.co\/jFxngDbZax","26":"Combating #coronavirus: Chinese #Covid19 vaccine okayed for military use https:\/\/t.co\/FislKuFgCH #UAE #Dubai #DXB","27":"Great update on where we’re at with #COVID19 #vaccine work https:\/\/t.co\/gIdCfMWxZ5","28":"Combating #coronavirus: Chinese #Covid19 vaccine okayed for military use https:\/\/t.co\/LXuzmvsOYg","29":"@errolbsk @Gentlements @scholaroflife2 Nothing for mahala right? Why the vaccine is not tested on the sick ones? Where was is it scientifically proven to be the Covid19 vaccine?","30":"$3,120? That’s at least 33% MORE than they’re charging the rest of the world.\n\nAny #COVID19 vaccine or treatment – ESPECIALLY those developed w\/ taxpayer $– must be affordable &amp; accessible.\n\nRight now, nothing protects Americans from Rx prices, even during a public health crisis. https:\/\/t.co\/2R7fUhegCn","31":"The Trump administration 100% knew about #COVID19 in January because this admin reached out to Pharma to develop a #COVID19 vaccine in mid-January. \n\nThat can be proven. \n\n@DNC @TeamPelosi @JoeBiden @TDucklo @SymoneDSanders @RepAdamSchiff @KamalaHarris @PeteButtigieg @DickDurbin https:\/\/t.co\/4QRV7q2Mhb","32":"Fauci expresses doubts over potential #COVID19 vaccine efficacy in US due to anti-vaxxers https:\/\/t.co\/GhDQ1AnwzE","33":"Want a challenge? Producing a #COVID19  #vaccine  distributing it and administering it to potentially 60% of the world's population in about a year is what the #Biomedical #SupplyChain and healthcare technology industries  are facing. \nhttps:\/\/t.co\/UnRPSrFyFb","34":"@jentaub @gtconway3d Untrue....they 100% knew in January because this admin reached out to Pharma to develop a #COVID19 vaccine in mid-January.","35":"Thank you to every individual who is making a positive impact in every possible way in this pandemic. Even if it is a small appreciation, it is truly valuable in this lonely unknown struggle in our daily lives. #COVID19 #vaccine #Corona #vaccine #MotivationMonday","36":"India’s first #COVID19 vaccine candidate COVAXIN has received approval of DCGI for phase I &amp; II of human clinical trials. The drug has been developed by Bharat Biotech.\nHuman clinical trials are scheduled to start across India in July 2020.\n@BharatBiotech","37":"Without Phase III trials...China’s military has received the greenlight to use a #COVID19 #vaccine candidate developed by its research unit and CanSino Biologics...  https:\/\/t.co\/9FSnQCQ66a","38":"Check out @BioRender's #COVID19 vaccine and therapeutics tracker! While you're there, subscribe for weekly email updates:  https:\/\/t.co\/GmJfSsgTMw","39":"Gilead wants people to spend over $3,000 for a COVID19 vaccine. We need price controls and free healthcare now more than ever in this pandemic. Shut up. https:\/\/t.co\/fbJEUm7uPh","40":"India’s first potential #COVID19 vaccine, “#COVAXIN”, the first to be developed in India, has been given DCGI (Drug Controller General of India) approval for Phase I and II human clinical trials that are scheduled to start across the country in July. https:\/\/t.co\/H0epyoo51f","41":"@FG_Hamza For COVID19 vaccine to be developed..what are your thoughts on that?","42":"4 billion COVID-19 vaccine doses? It's possible, CEPI official says\n#covid19 #covid19vaccine #vaccines https:\/\/t.co\/HFTR3T5Ab1","43":"\"what if we never have a #COVID19 vaccine?\"\n\nThen we'll get used to our new safety equipment, just like we did with seat belts.","44":"Human trials for a #coronavirus vaccine start next month! And they’re using cows?\n\n#coronavirus #COVID19 #vaccine #cowsforscience https:\/\/t.co\/4IibOYUT9z","45":"@sally_loveless @mflew2 @snittwit1 @timetoact2 @Lynda63986855 @Chicago1Ray @realDonaldTrump @nytimes @FoxNews @JoanneWT09 @roddy202620 @RfAmplifier @marjo219 @AmericanWom3n @demsrdopes @yidwithlid @WWG1WGA @deb33 @helper2 @Tj31Tim @DeathByLnbkers @hog_whisperer @spinson7746 @cmccbyfaith @establishmentno @GailRule1 @FarRight1_2 @mike9wood @NJ_2_FL @125LolaLola @MacShiver @janie520 @Kagey69 @Ggoodgirlsfirst @sustaineddaily @Q_Colorado_Q @rickyraper2014 @FaleroJr @AnnieOa87195326 @PRobinson153 @ks2020free @scott_cb @jyoungusmc I need context to answer your question about shots.\n\nWe have all had shots and some help.\n\nTrump is not forcing vaccines on us.\n\nWar would break out if he did.\n\nI would not take a Covid19 Vaccine.","46":"Vaxart ($VXRT) oral #COVID19 vaccine candidate joins @realDonaldTrump's \"Operation Warp Speed,\" as the company gears up to manufacture as many as 1 billion doses a year: https:\/\/t.co\/JnYaHgPKFK https:\/\/t.co\/tAmHzMQhW2","47":"How Antivaxxers are set to endanger public health again https:\/\/t.co\/wrSGGt0wVW @NYDailyNews #antivaxxer #publichealth #COVID19 #vaccine @NorthwellHealth","48":"India’s first #COVID19 vaccine candidate #COVAXIN gets DCGI approval; human trials to begin in July\n\n#BharatBiotech \n\nhttps:\/\/t.co\/fQs6uk01iK","49":"Me at the exact moment a COVID19 vaccine is discovered.\nhttps:\/\/t.co\/hTNtcfMP8q","50":"People are becoming over confident in science finding a COVID19 vaccine. Just remember a vaccine may only be 50 to 70% effective. We must all do our part to stop the current spread. The next life you save may be your own? https:\/\/t.co\/Rc3a8zqSr7","51":"\"The #WHO has identified #Covid19 #vaccine candidates developed by Oxford University-#AstraZeneca and #ModernaInc as the front-runners.\"\nhttps:\/\/t.co\/AUiTOXS97v","52":"Phase 3 #ClinicalTrials skipped, expedited testing on military subjects ...wait, #REB? \"#CanSino declined to disclose whether the innoculation of [#COVID19] #vaccine candidate is mandatory or optional, citing commercial secrets, in an email to Reuters.\" https:\/\/t.co\/5apYlBg5gX https:\/\/t.co\/eedLaZcZPy","53":"There’s no way in hell I am injecting myself, or my children with a Covid19 vaccine when it comes out. \n\nNot happening. \n\nI’ll let the rest of the population test that sucker out over the next decade 👍.\n\n#WontBeYourLabRat","54":"Our Policy and Advocacy Manager @elise_legault breaks down the numbers and explains what we need to do to join in the global effort to develop and distribute a #COVID19 vaccine ⬇️ https:\/\/t.co\/XxjpW66Prg","55":"The one reason I am still concerned about scientists finding an effective #COVID19 vaccine is that after all this time, they still haven't found a vaccine against stupidity and rage. https:\/\/t.co\/rNNepquCLH","56":"Trade idea: INO Clouds UP: Inovio races for the COVID19 Vaccine. Buy now and aim for the clouds (≥$35 shortly). The indicators here are preparing for a breakout. E.g. the Ichimoku #2 (link below) indicates a momentum change when price enters its range.… https:\/\/t.co\/FSdtKO641Q https:\/\/t.co\/YkLaluoOeo","57":"@CBCNews You don't have to be an anti-vaxer to question the necessity of a covid19 vaccine.  Covid viruses are notoriously hard to create vaccines for. They mutate easily. Sars doesn't have a vaccine. Questioning isn't a bad thing.","58":"lol #COVID19 vaccine discovered by chinese military lab seems a prank for conspiracists 🤣 https:\/\/t.co\/nBWdgzYoS4","59":"There's more capacity for systemic change than I've seen in my lifetime. In addition to demanding that #BlackLivesMatter, or socially distancing until we have a #COVID19 vaccine, we must fight for government budgets that are just and that reflect the changes we need. -@MTKRose","60":"#INDTODAY:  #BIG_BREAKING: After successfully testing animals, Union Health Min approves clinical human trails for #India's first #COVID19 vaccine-#Covaxin.Vaccine being co-develop by #BharatBiotech &amp; #icmr_niv. CM #KCR said #Covid vaccine will come from #Hyderabad by #August https:\/\/t.co\/FPkRhtIOFA","61":"Did I hear Dr. Fauci predict that a #COVID19 vaccine won’t solve the problem because so many ppl have said they’ll refuse it? I think this is part of an interview to be aired on @CNN. What a disgusting state of affairs - probably the same ppl who refuse to wear a mask.","62":"This is the perfect example of a risk hedge India required in addition to the @SerumInstIndia and @AstraZeneca @gavi #covid19 #vaccine candidate. Something I suggested in my opinion piece in @ETHealthWorld , https:\/\/t.co\/SCJykysKh7 https:\/\/t.co\/mgfV4NUzqm","63":"When #JonasSalk developed polio vaccine 65 years ago, he purposely didn't patent vaccine to speed its distribution, though by doing so he walked away from fortune. Will be interesting to see if his example followed today with #COVID19 vaccine developments. #CoronavirusPandemic https:\/\/t.co\/sG2QDaYZ6I","64":"Que bello es el capitalismo de desastres versión COVID19 vaccine 💉 https:\/\/t.co\/LhmPyHvLZR","65":"@GregMannarino If you’re still: \n•Smoking\n•Drinking alcohol regularly \n•Not exercising \n•Eating fast food \/drinking sodas\n•Consuming copious amounts of sugar\n•Waiting for the Covid19 vaccine\nPlease refrain from giving me a lecture on why I should be wearing a mask in public...\n\nThank you","66":"@davenewworld_2 And that is one indicator of why 1\/3 of Americans polled will refuse a #COVID19 vaccine.\nPropaganda and racism fuelled by @FoxNews is re-opening the racial divisions of time. \nA civil war continues silently underground like lava under Kilauea. \n(which is beautiful, sorry Hawaii)","67":"@CBCAlerts How do we know Wuhan virology lab did not have a COVID19 vaccine all along? How will we know if and when Covid 19 mutates into a Covid 20? \n21? 22? No body, particularly experts at @WHO at @MRC_Outbreak at @SecAzar , can\/will say when this man-made #pandemic will likely end !","68":"Government is allowing Covid19 vaccine trials in SA yet SA has small number of positive and death cases, has any media house ask why SA? Where is BLM and what are they saying about this or somethings are reserved for other?","69":"#INO had another strong close &amp; phenomenal day! Congrats to @InovioPharma for your 37th #birthday 🎂🥂🍾 #DNA #COVID19 #vaccine","70":"Why is @CNNBrasil covering about a #covid19 vaccine that don't actually exist yet? Brazilians love to live in lies. The closest we have is on LIMITED APPROVAL from the Chinese company CanSino Biologics. https:\/\/t.co\/AaCCrhmx7T","71":"Coronavirus vaccine को लेकर आई सबसे बड़ी खुशखबरी, Bharat Biotech ने कहा जुलाई से शुरू करेगी...\n#CoronavirusVaccine #COVID19Vaccine #BharatBiotech\nhttps:\/\/t.co\/3QWQOwmkW3","72":"🧪️ \"We would rather be in the situation where we can share with others than depending on others to share with us\" says Dr. Volker Gerdts @VIDOInterVac on #COVID19 #vaccine development. Get the full interview here: https:\/\/t.co\/0tjTJu78yf https:\/\/t.co\/K2AZsl225s","73":"Covid19 Vaccine\nThey are not sure when it will be ready.\nThey are not sure how long it will take to test it.\nThey are not sure if it will work on everyone.\n\nBUT THEY FIGURED OUT THE COST PER DOSE$$$$$\n\nsomething stinks here and it is big pharma. #BigPharma #TruthFreedomHealth","74":"#Covaxin— In a major breakthrough, India’s first COVID19 #Vaccine developed by #BharatBiotech in collaboration wid ICMR-NIV gets DGCI approval for Phase I, II human trials.\n#CoronaVirusUpdates #CoronaVirusUpdate #CoronaUpdates #CoronaUpdate #Hyderabad #Telangana #CoronaVirusIndia https:\/\/t.co\/y77AQ79zY9","75":"#BIG_BREAKING: After successfully testing animals, Union Health Min approves clinical human trails for #India's first #COVID19 vaccine-#Covaxin. Vaccine being co-developed by #BharatBiotech &amp; #icmr_niv. #Telangana CM #KCR said #Covid vaccine will come from #Hyderabad by August. https:\/\/t.co\/EuqplUMmSD","76":"#COVID19 has highlighted the #inequalities of our world\nNow it is offering us an\nopportunity to bridge those\ninequalities and build a fairer world\nFor ALL\nCall for a global agreement\nto recognise #Covid19 vaccine as\na #globalcommongood\nPledge your support:\nhttps:\/\/t.co\/2KtjC00aGW https:\/\/t.co\/8n6JPwHWGt","77":"Researchers @UniofOxford are now testing their #COVID19 vaccine in multiple countries around the world - incl Brazil &amp; South Africa - to increase the chance of determining efficacy.\n\nA trial in the US is set to follow.\n\n@bmj_latest @NDMOxford\nhttps:\/\/t.co\/qtlhPUsTS5","78":"China approves Cansino’s adenovirus vaccine for military use for next year #COVID19 #vaccine #infectiousdisease https:\/\/t.co\/H0VRw9JcaW","79":"@jojofinger F**k Fauci I'm sick and tired of this little guy telling us what we should do. First he says you don't need a mask and then says you do. Now he's pushing the Covid19 Vaccine at us and shame people who don't comply. I'm fed with the #CovidHoax . Enough!","80":"#COVAXIN, #India's First #COVID19 #Vaccine Candidate, Set For Phase I, II Human Trials.\n#coronavirus #CoronaUpdatesInIndia #CoronaUpdates https:\/\/t.co\/VsE9uKoLIv","81":"Attention - #COVID19Vaccine Study Requests Healthy Adult Volunteers ages 65-85  For Clinical Research @nyulangone with Dr.Mark Mulligan @pfizer \nhttps:\/\/t.co\/ixFjrIhGc0","82":"Union Health Ministry gave nod for Human trials from July #COVID19 #Vaccine https:\/\/t.co\/NBffXjlQBZ","83":"@realDonaldTrump @nytimes @FoxNews Waiting on you to release the COVID19 vaccine just before Nov. election cause that's how your sicko rolls. Why else would you still test negative after all the exposure you've had? You've been vaccinated.","84":"#COVAXIN , #ndia's First #COVID19 Vaccine Candidate, Set For Phase I, II Human #Trials*\n\nअगर ट्रायल में कामियाबी मिली तो #भारत सुपरपावर की होड़ में आ जायेगा\n\n🙏🙏🙏🏼","85":"India’s first #COVID19  vaccine candidate .\n\nଭାରତର ପ୍ରଥମ  #COVID19 ଟିକା ପ୍ରାର୍ଥୀ।\n\n#ଶୁଆନୁବାଦ https:\/\/t.co\/b7FF6BmF3K","86":"China's CanSino says its #COVID19 vaccine candidate has been approved for military use in China. China’s Central Military Commission approved the vax, dubbed Adv-nCOV, on June 25 for a period of 1 year https:\/\/t.co\/OMtOUHBMA3","87":"When the press conference for the #COVID19 vaccine comes out. https:\/\/t.co\/jg1xpg8kpZ","88":"#Fauci: #COVID19vaccine will not be the #publichealth panacea Americans are hoping for https:\/\/t.co\/40maihkiwT #herdimmunity #ReopenAmerica #reopen #reopening #covidusa #COVID19US #CoronavirusUSA #COVID19USA","89":"#covid19 #vaccine #indiancompany #medicalprofessionals #india #LocalKoVocal #makeinindia https:\/\/t.co\/CvbSu7mcg0","90":"NewswireToday \/ SCHOTT Delivers Pharma Vials to Package 2 Billion Doses of COVID-19 Vaccines #SCHOTTUSA #Pharma #Vial #COVID19 #Vaccine #Glassmaker #OperationWarpSpeed #Borosilicate #Packaging #Manufacturing - https:\/\/t.co\/Y0UjORVfGn","91":"If you are interested in taking part in a #COVID19 #vaccine trial &amp; live in the greater Seattle area, consider joining a new registry, established by @KPWaResearch, for possible future studies. More info here: https:\/\/t.co\/X1qyQbpIHj https:\/\/t.co\/2iZMpp2fOO","92":"Indian first Covid19 vaccine ready for human trails https:\/\/t.co\/B5LuezHdzo","93":"@BharatBiotech gets #DCGI approval to conduct Phase 1&amp;2 human trials for India's first #COVID19 vaccine from July 2020. #COVAXIN gave promising safety &amp; effective immune response in preclinical trials.\n@DrHVoffice @doctorsoumya @LovingVaccines @snehiil \n\nhttps:\/\/t.co\/d4X3dFX3cJ","94":".@CatalentPharma is collaborating with US #biotech @moderna_tx for large-scale, commercial fill-finish manufacturing of Moderna’s #mRNA-based #COVID19vaccine candidate at Catalent’s biologics plant in #BloomingtonIN. It will also provide packaging capacity https:\/\/t.co\/R1rXHf1fcA","95":"Kudos! to cash-strapped and legislatively-devastated University of Alberta (thanks to Kenney and #UCP Govt) for their work. But let's not get cocky. There's TEN clinical trials for #Coronavirus #COVID19 vaccine globally and many more proposed vaccines in pre-trial stage #abpoli https:\/\/t.co\/OkMm4iwI08","96":"There are some helpful suggestions in this article bigger question is are the companies conducting the #COVID19 vaccine trials applying them? Covid-19 vaccine research must involve Black &amp; Latinx participants. Here are 4 ways to make that.. https:\/\/t.co\/lBlh4RCPZn via @statnews","97":"#COVID19 vaccine 🇨🇳 \nThe Ad5-nCoV is one of China's eight vaccine candidates approved for human trials at home and abroad for the respiratory disease caused by the new coronavirus. The shot also won approval for human testing in Canada. https:\/\/t.co\/IfADwwzQf4","98":"Saw this great video about #COVID19 vaccine and treatment progress. Science is certainly the way we get back to normal! @SenThomTillis \nhttps:\/\/t.co\/Z2QxrQC99b","99":"India’s first #COVID19  vaccine  COVAXIN set for haman trials. https:\/\/t.co\/aTdamHeRgh","100":"hope the world will have a #Covid19 vaccine very shortly as Oxford University's vaccine is in its' third phase of trial","101":"Join me tomorrow at 12pm for a Virtual Town Hall on reopening. A #COVID19 vaccine will be integral to keeping NYC open, but for it to be effective we must address inaccurate information and the public health challenge of vaccine hesitancy.\n\nRegister at: https:\/\/t.co\/UvMMZWuZh6 https:\/\/t.co\/j0yXmAHaEm","102":"The race to secure a COVID19 vaccine is on...and getting encoraging results. https:\/\/t.co\/rymgDcUxWg","103":"India’s first #COVID19  vaccine candidate COVAXIN gets DCGI approval; human trials to begin in July.\n#COVAXIN is an inactivated vaccine, created from a strain of SARS-CoV-2 that has shown promise in demonstrating extensive safety and effective immune responses. https:\/\/t.co\/kENuqcamrS","104":"Some good news amidst all the gloom👍🏻 India's 1st Covid19 Vaccine,Covaxin, has been granted permission by DCGI for Human Trials Phase-1 &amp; 2. Hoping for its success in saving mankind fr d deadly Corona! https:\/\/t.co\/B1O3oJ1eRU","105":"Here is a positive news on the Covid19 vaccine from India @ProfPCDoherty @realDonaldTrump \n\nhttps:\/\/t.co\/Rt8ItMDpbS","106":"ICYMI: @repgregwalden offered an MTR that would ensure House Democrats' drug pricing scheme won't prevent the development of a #COVID19 vaccine. A vote against Walden's MTR is a vote against lifesaving medical innovation. \n\nhttps:\/\/t.co\/ao7BYER7OQ","107":"Interested in participating in a covid19 vaccine clinical trial? Check out Wake Clinical for all the details! https:\/\/t.co\/EYiFdPAoVD","108":"#China's military has received the green light to use a #COVID19 #vaccine candidate developed by its research unit and CanSino Biologics after clinical trials proved it was safe and showed some efficacy. https:\/\/t.co\/wEzWqYkMrT","109":"இந்தியாவில் முதன்முறையாக, ‘கோவாக்சின்’ எனப்படும் கொரோனா வைரசுக்கான தடுப்பூசி மருந்து உருவாக்கப்பட்டுள்ளது. அந்த மருந்தை மனிதர்களுக்கு அளித்து பரிசோதனைகளை செய்ய, இந்திய மருந்துக் கட்டுப்பாட்டு ஆணையம் ஒப்புதல் அளித்துள்ளது. \n\n#covid19 | #vaccine | #covaxin | #india | #netrikkan","110":"India's efforts to develop a #COVID19 vaccine cross a crucial milestone. \n\nThe Drug Controller General of India approves Phase I and II human clinical trials of a potential vaccine 'COVAXIN'. The trials set to start in July.","111":"#Hyderabad \nCheckmate #COVID19\nVaccine for #coronavirus developed by @BharatBiotech \nHuman clinical trials underway\nhttps:\/\/t.co\/rmPq4Dp150 https:\/\/t.co\/Y8pYM9tulf https:\/\/t.co\/Xn74YOlaH4","112":"Vaxart is ramping up capacity to produce an oral #COVID19 vaccine, joining countless #manufacturers in the race for a healthcare breakthrough! #CreatorsRespond  https:\/\/t.co\/XPPfgSgBCf","113":"Potential #COVID19vaccine has re-energized anti-vaccination groups, health experts warn. Misinformation out in full force, and health officials must catch up, scientists say as anti-vaxxers are spreading it. https:\/\/t.co\/vDU9zsc0uk","114":"#Covid19 #CoronavirusIndia #BharatBiotech #Covid19vaccine DCGI approves Bharat Biotech’s Covid-19 vaccine for human clinical trials https:\/\/t.co\/gzeOkFCfyT","115":"India’s first #COVID19 vaccine candidate COVAXIN has received approval of DCGI for phase I &amp; II of human clinical trials. The drug has been developed by Bharat Biotech.\n\nHuman clinical trials are scheduled to start across India in July 2020 #DCGI #trials #bharatbiotech https:\/\/t.co\/sKIZfe5ZOF","116":"#Covid19vaccine  Does this government seriously think I am going to volunteer to test their vaccine?  Last time I looked, I was still black.  My trust in this government is 100% zilch. Please stop the letters.  My recycling bin is full.","117":"The 1st person received a #COVID19 #vaccine created by @imperialcollege. A 2nd booster dose to follow within 4 weeks. The trials are the 1st test of a new self-amplifying RNA (saRNA) technology, which has the potential to revolutionize vaccine development.\nhttps:\/\/t.co\/Sq140Othe3","118":"First indigenous #COVID19 vaccine by @BharatBiotech in collaboration with #ICMR &amp; #NIV is a welcome development. Pre-Clinical trials successful &amp; Human trails to begin.\n\nHon’ble @TelanganaCMO #KCR garu in early May stated that #Covid vaccine will come from #Hyderabad👇\n\n@KTRTRS https:\/\/t.co\/GFe2V1yQXS https:\/\/t.co\/DDxDna8SFH","119":".@WHO, @_AfricanUnion and others are working to create a framework on #vaccines to ensure equitable access to a #COVID19 vaccine in Africa. “Without an effective COVID vaccine for our continent, our future will be compromised,” said Dr. @JNkengasong. https:\/\/t.co\/ztgvewnPci","120":"#BIG_BREAKING: After successfully testing animals, Union Health Min approves clinical human trails for #India's first #COVID19 vaccine-#Covaxin. Vaccine being co-developed by @BharatBiotech &amp; @icmr_niv. #Telangana CM #KCR said #Covid vaccine will come from #Hyderabad by August https:\/\/t.co\/Cl8JYyB8En","121":"Hope to see Indian #COVID19 vaccine soon...\n\nhttps:\/\/t.co\/wy9qHJJnnq","122":"And here it is!!! —— #Covid19 #Vaccine  Gilead Sciences detailed its pricing plans for COVID-19 drug remdesivir  https:\/\/t.co\/5ME5ZVs9e1","123":"#BIG_BREAKING: After successfully testing animals, Union Health Min approves clinical human trails for #India's first #COVID19 vaccine-#Covaxin. Vaccine being co-developed by @BharatBiotech &amp; @icmr_niv. #Telangana CM #KCR said #Covid vaccine will come from #Hyderabad by August https:\/\/t.co\/Zcdow9MBJr","124":"📢#BIGBREAKING:\n\n#COVID19 vaccine COVAXIN, developed by @BharatBiotech, in collaboration with @ICMRDELHI @icmr_niv, receives approval for human clinical trials from Drug Controller General of India @CDSCO_INDIA_INF @MoHFW_INDIA .\n\n#IndiaFightsCorona\n#IndiaWillWin\n#VocalForLocal https:\/\/t.co\/IQBOTji3zp","125":"#CanSino's #COVID19Vaccine candidate approved for military use in China https:\/\/t.co\/AYyoeu2HhF $CASBF $SPY $SPX $DIA $DJI $DJIA $VXX $VIIX $TLT $IEF $TYX $TNX $MRNA $AZN $PFE $JNJ $MRK $IBB $INO $NVAX","126":"This is a really good, easy to understand overview of #COVID19 vaccine development - including information about the CanSino vaccine which was just approved for the Chinese military https:\/\/t.co\/on1htHEnC6 with the requisite beer brewing analogy","127":"A precursor Covid19 vaccine dispensation in America. \n\nGilead developed their remdesivir w\/app. $70 million in taxpayer funds, pricing w\/10x inflation in the US only.\n\n\"Public funding was indispensable at each stage, and government scientists led the early drug discovery team.\" https:\/\/t.co\/Bz3LFs6W2v","128":"#Covid19 vaccine might not get us the herd immunity if too many people refuse to get it, Fauci says https:\/\/t.co\/fMB2oX0JIj","129":"COVAXIN, India's first #COVID19 vaccine candidate, set for Phase I, II human trials https:\/\/t.co\/474tOBaHzB https:\/\/t.co\/JfjV8LTHuB","130":"Let's not celebrate prematurely. But #covaxin is first covid19 vaccine. Hope it does well for human trials. https:\/\/t.co\/A5FDAb3tSX","131":". @AstraZeneca leading the #Covid19 #vaccine race; may get results quite early: WHO https:\/\/t.co\/5d80syPp3b https:\/\/t.co\/clcBFR5NTq","132":"@biorender has an awesome #COVID19 vaccine and therapeutic drugs tracker that is updated every Monday, check it out: https:\/\/t.co\/pRvw0jn1hX","133":"After successfully testing animals,Union Health Min approves clinical human trails for #India's first #COVID19 vaccine-#Covaxin.developed by \n@BharatBiotech. CM KCR sir said Covid vaccine will come from #Hyderabad by August.  @KTRTRS @RaoKavitha @Eatala_Rajender https:\/\/t.co\/KDYXcYjvMA","134":"COVAXIN, India's first #COVID19 vaccine candidate, set for Phase I, II human trials https:\/\/t.co\/6RoasGajZl https:\/\/t.co\/CSvFoec3k9","135":"@GermanBiotech Another important question: \n\nDo we really need 150+ covid19 vaccines in developement?\n\nThe aggregate valuation of all those vaccine hopes are highly exagerated.\n\nI wouldn't invest a single $ in covid19 vaccine plays... far too much hype!","136":"#China’s military approves #COVID19 #vaccine for use on soldiers \nhttps:\/\/t.co\/H8ZcyUdVUm https:\/\/t.co\/OHndTAqoug","137":"India's efforts to develop a #COVID19 vaccine cross a crucial milestone. \n\nThe Drug Controller General of India approves Phase I and II human clinical trials of a potential vaccine 'COVAXIN'. The trials set to start in July.","138":"@BharatBiotech has received #DCGI approval for the initiation of Phase 1 Human Clinical Trials of India’s First #COVID19 #vaccine candidate, #Covaxin. Developed in collaboration with the @ICMRDELHI and the #NationalInstituteofVirology. \n\n#CoronaHaaregaIndiaJeetega https:\/\/t.co\/MrOBendv3B","139":"@johncardillo This black male was paid $3 in South Africa to test the white mans Covid19 vaccine ..... where is the thanks \n\nhttps:\/\/t.co\/mIuW9RMNBg","140":"Priority groups to receive the #COVID19 #vaccine are being discussed in advance of its release. https:\/\/t.co\/0P1jpuFpfZ https:\/\/t.co\/izsyNPjaSr","141":"If there was a god the #COVID19 vaccine would be a half-sheet cake from Costco","142":"8 of the 15 #COVID19vaccine on trial are from China🇨🇳 that today started human tests as well  (phase 3).\n\n#covid19Canada \n#COVID19Ontario","143":"@Yunus_Centre #LeaveNoOneBehind — Available to All across the globe\nDeveloping a vaccine is not enough\nWe need #globalsolidarity to ensure that every person has access to it\nEnsure #COVID19 #vaccine when available reaches everyone\nDeclare #COVID19vaccine a #PeoplesVaccine and #GlobalCommonGood","144":"#BREAKING : Union Health Min approves clinical human trails for #India’s 1st #COVID19 vaccine, being developed by Bharath Biotech n @icmr_niv - #Covaxin, they successfully tested on animals. Best wishes, BTW remember #Telangana CM KCR said #Covid vaccine wl come from #Hyderabad https:\/\/t.co\/eJzyKTkpEg","145":"As scientists work around the clock to develop a #COVID19 vaccine, we need to make sure we’re prepared to administer it when it’s available. Pharmacists should be a part of this process.  https:\/\/t.co\/VL3JfHZHKX","146":"ఇండియా కరోనా వ్యాక్సిన్..క్లినికల్ ట్రైల్స్ కు !\n\nhttps:\/\/t.co\/WgGgV5NrGV\n\n#COVID19  #vaccine","147":"China’s military is world’s first to use experimental #coronavirus #covid19 vaccine https:\/\/t.co\/FIbCAYMfpo via @scmpnews","148":"#BigBreakingNews India’s 1st COVID-19 Vaccine - COVAXIN™,Developed by @BharatBiotech gets #DCGI approval for Phase I &amp; II Human Clinical Trials #COVID19 #HumanClinicalTrials #COVID19vaccine #coronavirus @CNNnews18 @snehamordani story https:\/\/t.co\/7E9kPrTzZ4","149":"#INO has got tremendous shorts attacks again this morning but like last Fri it has got back from the bottom &amp; is fluctuating along break-even. Will surely see it in green EOD. BTW, today is @InovioPharma's 37th #birthday &amp; the eve of its P1 data release! #DNA #COVID19 #vaccine","150":"After successfully testing animals, Union Health Minstry approves clinical human trials for India's first #COVID19  vaccine #COVAXIN.\n\nThe Drug Controller General of India - CDSCO, Ministry of Health &amp; Family Welfare has granted permission to initiate Phase I and II human trials. https:\/\/t.co\/cCp0LjjiDs","151":"#China racing ahead in its hope to find a vaccine. CanSino's #COVID19 vaccine candidate approved for military use in China https:\/\/t.co\/VBhVR6YurT","152":"COVAXIN: India's First COVID-19 Vaccine Candidate Given DGCI Nod, Human Trials in July | Read full report #COVAXIN #COVID19 #Coronavirus #COVID19Vaccine \nhttps:\/\/t.co\/TwOW5li4gA","153":"@mitchellvii He is political through and through and also has personal interests in covid19 vaccine patents.  He should be fired.","154":"This is the Bill Gates global control agenda. What else will be in the Covid19 vaccine?  U.S. University Requiring Both Flu and COVID-19 Vaccines for Students to Enter Campus https:\/\/t.co\/m5VzUEBsD5 via @21WIRE","155":"Brazil and the UK have reached a deal to produce the #COVID19 vaccine developed by Oxford University researchers.\n\n“The research risk we’re taking is necessary given the urgency of an effective solution,” said deputy minister Élcio Franco of @minsaude.\n\nhttps:\/\/t.co\/FaWikhkSxF https:\/\/t.co\/ByacXdYLwd","156":"#BrainAwareness: Join us TODAY at 12 p.m. PST as we welcome Dr. @PeterHotez for a discussion on the history of #vaccines, #COVID19 vaccine development and more.\n\nAccess this free virtual lecture here: https:\/\/t.co\/DDJ6Npib0c \n\ncc: @bcmhouston https:\/\/t.co\/Y7ELp868hn","157":"Global Common Good\n#Covid_19 \n#covid19brasil \n#covid19vaccine \n#vaccine \n\nLula se une a abaixo-assinado internacional para que a vacina contra o coronavírus seja de graça e para todos: https:\/\/t.co\/lZLkEinyl6\n\nJunte-se!!\nAssine você também!","158":"If\/when we get #COVID19 vaccine all we need is for #antivaxxers who probably are refusing masks today to refuse vaccine so we continue to see spread of the virus #MasksSaveLives #SocialDistancing #StayHome  https:\/\/t.co\/Xd13toJGBn","159":"T 292\n@BharatBiotech  has received approval for human trials of 1st #COVID19 #vaccine in #India  #MakeInIndia #covaxin https:\/\/t.co\/1MEow1j4Cd","160":"Prices were eventually lowered not out of altruism but rather the result of student pressure: https:\/\/t.co\/SQbKR90MCF. Patents were standing in the way of essential access until students organized and called for change. We cannot let a #COVID19 vaccine be the next story.","161":"@PMOIndia @narendramodi COVID19 vaccine invention by India? .@narendramodi","162":"50% of USA DOESN'T TAKE #flushots ... many aren't wearing masks for #covid19 protection. how many will take #COVID19vaccine ?","163":"Serum Institute of India Pune launching #COVID19 Vaccine by October.\nConfirmed News.\n3rd stage trial completed.....\n\n@manishBJPUP","164":"Fauci Warns #covid19 Vaccine Unlikely To Provide Herd Immunity If Portion Of Population Refuse It more at https:\/\/t.co\/DYN9qY8I53 https:\/\/t.co\/5zFgdbXgOe","165":"The country’s ‘first’ indigenous #COVID19vaccine #COVAXIN, developed by city-based @BharatBiotech in collaboration with @ICMRDELHI and @icmr_niv, has got the nod for human clinical trials from the Drug Controller General of India \n\nhttps:\/\/t.co\/IlYJeE4uZt","166":"#COVID19 #Vaccine #COVAXIN #DCGI #Approved #HumanClinicalTrial #India #National #DY365\nIndia's first COVID-19 vaccine candidate 'COVAXIN' gets DCGI approval, human trials to begin in July https:\/\/t.co\/PgMu9jhRv0","167":"A #COVID19 vaccine work group is developing strategies and identifying priority groups for vaccination  https:\/\/t.co\/51rum1B8Ee","168":"Looking at polls saying most Americans would not use a #COVID19 vaccine once available, Dr. Fauci notes that it’s unlikely the introduction of a #vaccine would result in herd immunity. https:\/\/t.co\/JYfY41MzGH https:\/\/t.co\/AbCbIJLPMR","169":"Those who wear masks and adhere to regulations, “protect” themselves and those who disregard masks, regulations, etc. I think this could be the ‘proof of concept’ for a  #covid19vaccine, notwithstanding the existing knowledge on broader vaccine sentiment(s)","170":"#BIG_BREAKING: After successfully testing animals, Union Health Min approves clinical human trials for  India's first COVID19 vaccine #Covaxin.The vaccine being co-developed by Bharat Biotech &amp; \n@icmr_niv COVID vaccine will come from Hyderabad by August https:\/\/t.co\/gaMArqcW7r","171":"@WHO says AstraZeneca, Moderna are ahead in #COVID19 vaccine race https:\/\/t.co\/zqDAo1QKKZ #coronavirus","172":"Check out this post from Cincinnati Children's - COVID-19 Update: Vax Trial Begins, Local Cases Rise https:\/\/t.co\/nrymikAT1w #covid19vaccine #cincinnatichildrens","173":"Equitable access to #healthcare saves lives and levels the playing field. Good read from @gatesfoundation highlighting @gavi’s commitment to #COVID19 vaccine access for #LMICs https:\/\/t.co\/xeTYmZ907R","174":"Dr. Fauci says, “I would settle for [a] 70, 75% effective [COVID-19] vaccine\", but worries many Americans suggesting they won’t get a #COVID19 vaccine, paired with incomplete protection, will make it unlikely the US can put an end to the pandemic. #HHF\n\nhttps:\/\/t.co\/D4n7Tm5k8Z","175":"After successful testing on animals, @MoHFW_INDIA @CDSCO_INDIA_INF approves clinical human trails for #India's first #COVID19 vaccine #Covaxin being co-developed by @BharatBiotech &amp; @icmr_niv   \n@JustHydThings @HiHyderabad @SyedAamirQuad10","176":"#BIG_BREAKING: After successfully testing animals,Union Health Min approves clinical human trails for  India's first COVID19 vaccine #Covaxin.Vaccine being co-developed by Bharat Biotech &amp; @icmr_niv. Telangana CM #KCR said Covid vaccine will come from Hyderabad by August @KTRTRS https:\/\/t.co\/Xq1ZxMRYJT","177":"As the pandemic continues to impact our lives, how can the #pharmaceutical industry meet global demand for a #COVID19 vaccine? My colleague, Jennifer DiMambro, discusses the various factors involved: https:\/\/t.co\/mEbPYTXaLP @ArupAmericas","178":"NPR shared an interview where a Dr. said 1\/3 of Americans in this poll  would not get a COVID19 vaccine if one came available. Meaning that there could possibly be not enough ppl vaccinated to actually prevent COVID19. Good morning &amp; damn the USA!","179":"\"Doctor\" Fauci says if everyone doesn't get the covid19 vaccine then it won't help vs the virus. Tell me, how has the flu shot helped reduce the flu and why are ppl who take it still catching it. 🤔🤔 Shove it... I'll take my chances","180":"#India's first #COVID19 #Vaccine - #COVAXIN gets nod for for phase I and II of human clinical trials. Trials are scheduled to start in #July.\n\n#IndiaFightsCorona #coronavirus #Corona","181":"Daily update: 29th June 2020\n\nGBP\/AUD: 4th Biggest Daily Case Rise in Australia Since Pandemic Began \n\nhttps:\/\/t.co\/7cshWB6r0v  \n\n#currencynews #AussieDollar #coronavirus #Covid19Vaccine #gbpaud","182":"#BreakingNews : After successfully testing animals, Union Health Min approves clinical human trails for #India's first #COVID19 vaccine-#Covaxin. #Vaccine being co-developed by #BharatBiotech &amp; #icmr_niv. #COVAXIN #covanceclinical #coronavirus #Covid_19 #COVID19 #coronavaccine","183":"A simply explained thread on why we need a free #COVID19 Vaccine. We are already paying for it through our tax payer dollars. Please consider singing in support at https:\/\/t.co\/fTsNLr8upE if you believe patents should not stand in the way of access to a vaccine this world needs. https:\/\/t.co\/357tQTst46","184":".@repgregwalden makes the case that the House should not pass Speaker Pelosi's partisan drug pricing scheme that will result in fewer cures when the world is relying on American innovation for a #COVID19 vaccine.\n\nRead more here ⬇️\nhttps:\/\/t.co\/xb0YLsTSt7","185":"China’s military to be used as guinea pigs for unproven #COVID19 vaccine while cheap, safe, effective, early treatments are vilified by health officials &amp; media in bed w\/ big pharma. @StevePhillipsMD @marybethpf @microbeminded2 @JamesTodaroMD @lifebiomedguru @zev_dr @NIAIDNews https:\/\/t.co\/fpQILFKlEh","186":"Until we have an effective #COVID19 vaccine, there are 5 priorities every country must focus on *right now* to turn the the tide of #coronavirus, says @WHO chief @DrTedros:\n\n1⃣ Empower communities\n2⃣ Suppress transmission\n3⃣ Save lives\n4⃣ Accelerate R&amp;D\n5⃣ Political leadership","187":"@1000histoires @heiniryssy @LuukkanenKatja @HeikkiRay @Scandinavian63 \"Miksi edes lääkäreitä ei kiinnosta..\" ⁉️\n\nhttps:\/\/t.co\/2VJdXYIklZ\n\n#covid19 #covid19fi #covid19vaccine","188":"Vaccine scientist Dr. @PeterHotez &amp; @Rotary’s @JohnHewko believe no child should have to suffer from a vaccine-preventable disease like polio, but when a #COVID19 vaccine is discovered, will it be accepted? Read their thoughts: @CNNOpinion https:\/\/t.co\/TJQmITk3rD","189":".@ToinenM #spam #troll account =&gt; reported to @TwitterSafety for posting false info on #Covid19 #covid19fi #covid19vaccine ❌","190":"Every race, gender and ethnicity should be represented in #COVID19 vaccine trials. We already know the virus affects people differently and it is the only way we will ensure the vaccine protects all communities. https:\/\/t.co\/SxGGROTZRs","191":"India’s first #COVID19 vaccine candidate COVAXIN has received the approval of drug regulator DCGI for phase I and II of human clinical trials. \n#COVAXIN #coronavaccine #IndiaFightsCorona #coronavirus #Covid_19 #CoronaVirusUpdates https:\/\/t.co\/GJ36dEBjzc","192":"WHO, partners plan to deliver 2 billion doses of Covid-19 vaccine to high-risk population #covid19 #covid19vaccine  https:\/\/t.co\/ZnZS67TpDa via @statnews","193":"BIG_BREAKING:- After successfully testing animals, Union Health Min approves clinical human trails for #India's first #COVID19 vaccine-#Covaxin. Vaccine being co-developed by @BharatBiotech &amp; @icmr_niv. \n\nTelangana CM KCR said Covid vaccine will come from #Hyderabad by August https:\/\/t.co\/MPUvFxubiI","194":"Vaccination started  on June 25, for China's Military personnel only, planned for one year\n#COVID19 #vaccine\n👇 https:\/\/t.co\/qP0QPhxaCL","195":"The COVAX pillar aims to ensure the most viable #COVID19 vaccine candidates get the support needed to succeed, and are then produced at scale to reach everyone, everywhere. Read @GaviSeth’s Q&amp;A on how the pillar will help bring the pandemic to an end: https:\/\/t.co\/bT600jcfuj","196":"ಯಾವ ದೇಶ ಮೊದಲಿಗೆ ಪಡೆಯುತ್ತೆ ಕರೊನಾ ಲಸಿಕೆ? ಭಾರತಕ್ಕೂ ಖುಲಾಯಿಸುತ್ತೆ ಅದೃಷ್ಟ\n#Whowillfirst #Covid19vaccine #Oxford #US #briton #china #India\nhttps:\/\/t.co\/ddQQHCTXbT","197":"#TikTok + 58 Chinese apps ban:\nProbably the Second Happiest News Ever \nAfter that of #COVID19 Vaccine news that'll rule in the future‼️\n\n\"God Why does this give so much Happiness 😍\"\n#tiktokbanindia #DigitalAirStrike #ChineseAppsBlocked\n#59Chineseapps","198":"India’s FIRST #COVID19 #vaccine candidate #COVAXIN, developed by @BharatBiotech @ICMRDELHI, National Institute of Virology, #Pune  received Drug Control General's approval for phase I and II of human trials. #AtmaNirbharBharat \nhttps:\/\/t.co\/zjbAHnbFDI","199":"We shouldn't forget the importance of regular #vaccines at the same time as sprinting for the finish line for a #COVID19 vaccine. Today's eye watering stat... \n\n(side note: this is 2nd hand from a Chatham House Rule meeting - great if anyone at @LSHTM can validate this!) https:\/\/t.co\/Vb2inoVJ8A"}}
